In [4]:
import pandas as pd
df = pd.read_csv("eval.csv")
df

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,35.0,0,0,8.0500,Third,unknown,Southampton,y
1,0,male,54.0,0,0,51.8625,First,E,Southampton,y
2,1,female,58.0,0,0,26.5500,First,C,Southampton,y
3,1,female,55.0,0,0,16.0000,Second,unknown,Southampton,y
4,1,male,34.0,0,0,13.0000,Second,D,Southampton,y
...,...,...,...,...,...,...,...,...,...,...
259,1,female,25.0,0,1,26.0000,Second,unknown,Southampton,n
260,0,male,33.0,0,0,7.8958,Third,unknown,Southampton,y
261,0,female,39.0,0,5,29.1250,Third,unknown,Queenstown,n
262,0,male,27.0,0,0,13.0000,Second,unknown,Southampton,y
263,1,male,26.0,0,0,30.0000,First,C,Cherbourg,y

In [9]:
pip install numpy
pip install numpy -q -upgrade

Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.12/site-packages (1.26.4)
Note: you may need to restart the kernel to use updated packages.

In [15]:
import numpy as np

array = np.array([1,2,3,4,5])
array
print("자료형: ", array.dtype)

자료형:  int64

In [11]:
import numpy as np
matrix = np.array([[1,2,3], [4,5,6]])
print("배열의 값\n", matrix)
print("배열의 전체 합\n", np.sum(matrix))
print("배열의 전체 평균\n", np.mean(matrix))
print("배열의 최소\n", np.min(matrix))
print("배열의 최대\n", np.max(matrix))
print("배열의 전치\n", matrix.T)
print("배열의 변환\n", matrix.reshape(3,2))

배열의 값
 [[1 2 3]
 [4 5 6]]
배열의 전체 합
 21
배열의 전체 평균
 3.5
배열의 최소
 1
배열의 최대
 6
배열의 전치
 [[1 4]
 [2 5]
 [3 6]]
배열의 변환
 [[1 2]
 [3 4]
 [5 6]]

In [46]:
print("나이는 " + str(30) + "입니다.")
print(f"나이는 {30}입니다.")
print("apple", "banana", "cherry")
print("apple", "banana", "cherry", sep= " / ")
print("apple\tbanana\tcherry")
print("Hello", end= "") #기본 \n을 줄바꿈 없음으로 설정
print("Hello")
print("Hello")

name = "Charlie"
age = 28
hobby = "reading"
print("{} {} {}".format(name, age, hobby))

print(type(3))
print(type("name"))
print(len(name))
print((name + " ") * 3)

나이는 30입니다.
나이는 30입니다.
apple banana cherry
apple / banana / cherry
apple	banana	cherry
HelloHello
Hello
Charlie 28 reading
<class 'int'>
<class 'str'>
7
Charlie Charlie Charlie

In [27]:
pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [30]:
import pandas as pd
data = [10, 20, 30, 40]
series = pd.Series(data)
print("Series:\n", series)
print("Series[0]: ", series[0])

Series:
 0    10
1    20
2    30
3    40
dtype: int64
Series[0]:  10

In [41]:
import pandas as pd
data = {
    "이름": ["김철수", "이영희", "박민수"],
    "수학": [85, 90, 78],
    "영어": [88, 84, 95]
}
df = pd.DataFrame(data)
print(df)
print("\n\nDataFrame:\n",df)

    이름  수학  영어
0  김철수  85  88
1  이영희  90  84
2  박민수  78  95


DataFrame:
     이름  수학  영어
0  김철수  85  88
1  이영희  90  84
2  박민수  78  95

    이름  수학  영어
0  김철수  85  88
1  이영희  90  84
2  박민수  78  95